BitNibble/STM32F411CEU6/workspace/F411CEU6-4/lib/src/st7789.c
/*************************************************************************
	ST7789
Author:   <sergio.salazar.santos@gmail.com>
License:  GNU General Public License     
Hardware: ST7789 on stm32f411ceu6
Date:     23/01/2026
*************************************************************************/

/*** Library ***/
#include "st7789.h"
#include "stm32fxxxgpio.h"
#include "armsystick.h"
#include <stdlib.h>
#include <math.h>

/*** Define & Macros ***/
// Optional X/Y offsets for 240x240 modules
#define ST7789_X_OFFSET 0
#define ST7789_Y_OFFSET 0

#define ST_CMD_DELAY 0x80 // special signifier for command lists

#define ST77XX_NOP 0x00
#define ST77XX_SWRESET 0x01
#define ST77XX_RDDID 0x04
#define ST77XX_RDDST 0x09

#define ST77XX_SLPIN 0x10
#define ST77XX_SLPOUT 0x11
#define ST77XX_PTLON 0x12
#define ST77XX_NORON 0x13

#define ST77XX_INVOFF 0x20
#define ST77XX_INVON 0x21
#define ST77XX_DISPOFF 0x28
#define ST77XX_DISPON 0x29
#define ST77XX_CASET 0x2A
#define ST77XX_RASET 0x2B
#define ST77XX_RAMWR 0x2C
#define ST77XX_RAMRD 0x2E

#define ST77XX_PTLAR 0x30
#define ST77XX_TEOFF 0x34
#define ST77XX_TEON 0x35
#define ST77XX_MADCTL 0x36
#define ST77XX_COLMOD 0x3A

#define ST77XX_MADCTL_MY 0x80
#define ST77XX_MADCTL_MX 0x40
#define ST77XX_MADCTL_MV 0x20
#define ST77XX_MADCTL_ML 0x10
#define ST77XX_MADCTL_RGB 0x00

#define ST77XX_RDID1 0xDA
#define ST77XX_RDID2 0xDB
#define ST77XX_RDID3 0xDC
#define ST77XX_RDID4 0xDD

/*** Procedure and Function Definition ***/
// Returns the next multiple of 8 >= width
uint16_t _pad_width8(uint16_t width){
	return (width + 7) & ~7;
}

uint16_t _glyph_size_bytes(uint16_t width, uint16_t height){
	return ((width + 7) / 8) * height;
}

static inline void st7789_cs(ST7789_par* par, uint8_t val) {
	if(val) set_pin(par->scl_gpio, par->cs_pin);
	else    clear_pin(par->scl_gpio, par->cs_pin);
}

static inline void st7789_dc(ST7789_par* par, uint8_t val) {
	if(val) set_pin(par->scl_gpio, par->dc_pin);
	else    clear_pin(par->scl_gpio, par->dc_pin);
}

static inline void st7789_rst(ST7789_par* par, uint8_t val) {
	if(val) set_pin(par->scl_gpio, par->rst_pin);
	else    clear_pin(par->scl_gpio, par->rst_pin);
}

// Reset the display
static inline void st7789_reset(ST7789_par* par) {
	st7789_rst(par, 0); _delay_ms(10); st7789_rst(par, 1);
	_delay_ms(120);
}

static inline void st7789_start(ST7789_par* par) {
	clear_pin(par->scl_gpio, par->cs_pin);
}

static inline void st7789_stop(ST7789_par* par) {
	set_pin(par->scl_gpio, par->cs_pin);
}

static inline void _spi_wait_txe(SPI_TypeDef *spi, uint32_t timeout)
{
    for( ;!(spi->SR & SPI_SR_TXE) && timeout; timeout--);
}

static inline void _spi_wait_bsy(SPI_TypeDef *spi, uint32_t timeout)
{
    for( ;(spi->SR & SPI_SR_BSY) && timeout ; timeout--);
}

static inline void st7789_spi_tx(ST7789_par* par, uint8_t d)
{
    SPI_TypeDef *spi = par->spi;

    _spi_wait_txe(spi, 10000);

    *(__IO uint8_t*)&spi->DR = d;

    _spi_wait_bsy(spi, 10000);
}

// Send a command byte
static inline void st7789_cmd(ST7789_par* par, uint8_t c) {
	st7789_dc(par, 0);
	st7789_spi_tx(par, c);
}

// Send a data byte
static inline void st7789_data(ST7789_par* par, uint8_t d) {
	st7789_dc(par, 1);
	st7789_spi_tx(par, d);
}

void st7789_set_caset(ST7789_par* par, uint16_t x0, uint16_t x1)
{
	U_word w;
	
	st7789_cmd(par, ST77XX_CASET);
	w = writeHLbyte(x0 + ST7789_X_OFFSET); st7789_data(par, w.par.h); st7789_data(par, w.par.l);
	w = writeHLbyte(x1 + ST7789_X_OFFSET); st7789_data(par, w.par.h); st7789_data(par, w.par.l);
}

void st7789_set_raset(ST7789_par* par, uint16_t y0, uint16_t y1)
{
	U_word w;

	st7789_cmd(par, ST77XX_RASET);
	w = writeHLbyte(y0 + ST7789_Y_OFFSET); st7789_data(par, w.par.h); st7789_data(par, w.par.l);
	w = writeHLbyte(y1 + ST7789_Y_OFFSET); st7789_data(par, w.par.h); st7789_data(par, w.par.l);
}

// Initialization sequence
void st7789_init_seq(ST7789_par* par) {
	st7789_start(par);
	/***/
	//st7789_start(par);
	st7789_cmd(par, ST77XX_SWRESET); // SWRESET
	st7789_stop(par);
	
	_delay_ms(150);
	
	st7789_start(par);
	st7789_cmd(par, ST77XX_SLPOUT); // SLPOUT
	st7789_stop(par);
	
	_delay_ms(120);
	
	st7789_start(par);
	st7789_cmd(par, ST77XX_COLMOD); // COLMOD
	st7789_data(par, 0x55); // 0x55, 0x05
	//st7789_stop(par);

	//st7789_start(par);
	st7789_cmd(par, 0x36); // MADCTL
	st7789_data(par, 0x00); // 0x00, 0x08, 0xC0, 0x60
	//st7789_stop(par);

	// CASET
	//st7789_start(par);
	st7789_set_caset(par, 0x0000, 0x00EF);
	//st7789_stop(par);
	
	// RASET
	//st7789_start(par);
	st7789_set_raset(par, 0x0000, 0x00EF); 
	//st7789_stop(par);
	
	//st7789_start(par);
	st7789_cmd(par, ST77XX_INVON); // INVON
	//st7789_stop(par);

	_delay_ms(10);

	//st7789_start(par);
	st7789_cmd(par, ST77XX_NORON); // NORON
	//st7789_stop(par);
	
	_delay_ms(10);
	
	/***/
	//st7789_start(par);
	st7789_cmd(par, ST77XX_DISPON); // DISPON
	//st7789_stop(par);
	/***/
	
	_delay_ms(20);
	/***/
	st7789_stop(par);
}

void st7789_set_window(ST7789_par* par, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
{
	st7789_set_caset(par, x0, x1);

	st7789_set_raset(par, y0, y1);

	st7789_cmd(par, ST77XX_RAMWR);
}

void st7789_shift_pixel(ST7789_par* par, uint16_t color) {
	U_word data = { .var = color };
	// Send pixel data MSB first
	st7789_data(par, data.par.h);
	st7789_data(par, data.par.l);
}

// Draw a single pixel
void st7789_draw_pixel(ST7789_par* par, uint16_t x, uint16_t y, uint16_t color) {
	
	if(x >= par->width || y >= par->height) return;

	st7789_set_window(par, x, y, x, y);
	// Send pixel data MSB first
	st7789_shift_pixel(par, color);
}

void st7789_fill_screen(ST7789_par* par, uint16_t color) {
	for (uint16_t y = 0; y < par->height; y++) {
		for (uint16_t x = 0; x < par->width; x++) {
			st7789_draw_pixel(par, x, y, color);
		}
	}
}

void st7789_draw_bits(ST7789_par* par, uint8_t byte, uint16_t fg, uint16_t bg){
	U_word FG = { .var = fg };
	U_word BG = { .var = bg };
	U_byte BYTE = { .var = byte };
	if(BYTE.par.bit7){st7789_data(par, FG.par.h);st7789_data(par, FG.par.l);}else{st7789_data(par, BG.par.h);st7789_data(par, BG.par.l);}
	if(BYTE.par.bit6){st7789_data(par, FG.par.h);st7789_data(par, FG.par.l);}else{st7789_data(par, BG.par.h);st7789_data(par, BG.par.l);}
	if(BYTE.par.bit5){st7789_data(par, FG.par.h);st7789_data(par, FG.par.l);}else{st7789_data(par, BG.par.h);st7789_data(par, BG.par.l);}
	if(BYTE.par.bit4){st7789_data(par, FG.par.h);st7789_data(par, FG.par.l);}else{st7789_data(par, BG.par.h);st7789_data(par, BG.par.l);}
	if(BYTE.par.bit3){st7789_data(par, FG.par.h);st7789_data(par, FG.par.l);}else{st7789_data(par, BG.par.h);st7789_data(par, BG.par.l);}
	if(BYTE.par.bit2){st7789_data(par, FG.par.h);st7789_data(par, FG.par.l);}else{st7789_data(par, BG.par.h);st7789_data(par, BG.par.l);}
	if(BYTE.par.bit1){st7789_data(par, FG.par.h);st7789_data(par, FG.par.l);}else{st7789_data(par, BG.par.h);st7789_data(par, BG.par.l);}
	if(BYTE.par.bit0){st7789_data(par, FG.par.h);st7789_data(par, FG.par.l);}else{st7789_data(par, BG.par.h);st7789_data(par, BG.par.l);}
}

void st7789_drawfont8x12(ST7789_par* par, char c, uint16_t x, uint16_t y, uint16_t fg, uint16_t bg)
{
	const uint8_t first  = 32;   // first ASCII in font
	const uint8_t glyph_width  = 8;
	const uint8_t glyph_height = 12;

	if(c < first || c > 126) return;      // ignore out-of-range chars

	uint16_t base = (c - first) * glyph_height;

	// Local copies for bounds checking
	uint16_t w = glyph_width;
	uint16_t h = glyph_height;
	if(x + w > par->width)  w = par->width - x;
	if(y + h > par->height) h = par->height - y;

	st7789_set_window(par, x, y, x + w - 1, y + h - 1);
	
	for(uint8_t row = 0; row < h; row++)
	{
		uint8_t bits = pgm_read_byte(&font8x12[base + row]); // <-- must use &font8x12[index]!
		st7789_draw_bits(par, bits, fg, bg);
	}
}

