BitNibble/STM32F411CEU6/workspace/F411CEU6-4/lib/src/st7789.c
void st7789_drawstring8x12(ST7789_par* par, const char* str, uint16_t x, uint16_t y, uint16_t fg, uint16_t bg)
{
	uint16_t cursorX = x;
	uint16_t cursorY = y;

	while (*str) {
		char c = *str++;

		// Draw the character
		st7789_drawfont8x12(par, c, cursorX, cursorY, fg, bg);

		// Advance cursor
		cursorX += 8;  // width of font8x12

		// Optional: wrap if it goes off the edge
		if (cursorX + 8 > par->width) {
			cursorX = 0;
			cursorY += 12; // height of font8x12
		}

		// Optional: stop if we go off the bottom
		if (cursorY + 12 > par->height) break;
	}
}

void st7789_drawfont16x16(ST7789_par* par, char c, uint16_t x, uint16_t y, uint16_t fg, uint16_t bg)
{
	const uint8_t first  = 32;
	const uint8_t glyph_width  = 16;
	const uint8_t glyph_height = 16;

	if(c < first || c > 126) return;

	uint16_t base = (c - first) * glyph_height;
	
	// Local copies for bounds checking
	uint16_t w = glyph_width;
	uint16_t h = glyph_height;
	if(x + w > par->width)  w = par->width - x;
	if(y + h > par->height) h = par->height - y;

	st7789_set_window(par, x, y, x + w - 1, y + h - 1);

	for(uint8_t row = 0; row < glyph_height; row++) {
		U_word bits = { .var = pgm_read_word(&font16x16[base + row]) };
		st7789_draw_bits(par, bits.par.h, fg, bg);
		st7789_draw_bits(par, bits.par.l, fg, bg);
	}
}

void st7789_drawstring12x16(ST7789_par* par, const char* str, uint16_t x, uint16_t y, uint16_t fg, uint16_t bg)
{
	uint16_t cursorX = x;
	while(*str) {
		char c = *str++;
		st7789_drawfont16x16(par, c, cursorX, y, fg, bg);
		cursorX += 12; // fixed spacing
		if(cursorX + 12 > par->width) break;
	}
}

void st7789_drawfont24x24( ST7789_par* par, char c, uint16_t x, uint16_t y, uint16_t fg, uint16_t bg ){
	const uint8_t first = 32;
	const uint8_t glyph_w = 24;
	const uint8_t glyph_h = 24;

	if(c < first || c > 126) return;

	uint16_t base = (c - first) * glyph_h * 3;

	uint16_t w = glyph_w;
	uint16_t h = glyph_h;
	if(x + w > par->width)  w = par->width - x;
	if(y + h > par->height) h = par->height - y;

	st7789_set_window(par, x, y, x + w - 1, y + h - 1);

	for(uint8_t row = 0; row < h; row++) {
		uint8_t b2 = pgm_read_byte(&font24x24[base + row*3 + 0]);
		uint8_t b1 = pgm_read_byte(&font24x24[base + row*3 + 1]);
		uint8_t b0 = pgm_read_byte(&font24x24[base + row*3 + 2]);

		st7789_draw_bits(par, b2, fg, bg);
		st7789_draw_bits(par, b1, fg, bg);
		st7789_draw_bits(par, b0, fg, bg);
	}
}

void st7789_drawstring16x24( ST7789_par* par, const char* str, uint16_t x, uint16_t y, uint16_t fg, uint16_t bg ){
	uint16_t cursorX = x;

	while(*str){
		char c = *str++;
		st7789_drawfont24x24(par, c, cursorX, y, fg, bg);
		cursorX += 16;

		if(cursorX + 16 > par->width) break;
	}
}

void st7789_draw_line(ST7789_par* par, int x0, int y0, int x1, int y1, uint16_t color)
{
	int dx = abs(x1 - x0);
	int sx = x0 < x1 ? 1 : -1;
	int dy = -abs(y1 - y0);
	int sy = y0 < y1 ? 1 : -1;
	int err = dx + dy; // error term

	while (1) {
		st7789_draw_pixel(par, x0, y0, color); // draw the pixel
		if (x0 == x1 && y0 == y1) break;
		int e2 = 2 * err;
		if (e2 >= dy) { err += dy; x0 += sx; } // move in x
		if (e2 <= dx) { err += dx; y0 += sy; } // move in y
	}
}

// Draw line using y = m*x + b
void st7789_draw_line_eq(ST7789_par* par, float m, float b, int x_start, int x_end, uint16_t color){
	if(x_end < x_start) {
		// swap to ensure x_start <= x_end
		int tmp = x_start; x_start = x_end; x_end = tmp;
	}

	for(int x = x_start; x <= x_end; x++) {
		float y_f = (par->height - 1) - m * x + b;
		
		int y = (int)(y_f + 0.5f); // round to nearest integer

		if(x < 0 || x >= (int)par->width) continue;
		if(y < 0 || y >= (int)par->height) continue;

		st7789_draw_pixel(par, x, y, color);
	}
}

void st7789_draw_circle( ST7789_par* par, int x0, int y0, int r, uint16_t color ){
	if(r <= 0) return;

	int x = r;
	int y = 0;
	int err = 1 - x;

	while(x >= y) {
		st7789_draw_pixel(par, x0 + x, y0 + y, color);
		st7789_draw_pixel(par, x0 + y, y0 + x, color);
		st7789_draw_pixel(par, x0 - y, y0 + x, color);
		st7789_draw_pixel(par, x0 - x, y0 + y, color);
		st7789_draw_pixel(par, x0 - x, y0 - y, color);
		st7789_draw_pixel(par, x0 - y, y0 - x, color);
		st7789_draw_pixel(par, x0 + y, y0 - x, color);
		st7789_draw_pixel(par, x0 + x, y0 - y, color);

		y++;

		if(err < 0) {
			err += 2*y + 1;
			} else {
			x--;
			err += 2*(y - x) + 1;
		}
	}
}

// Draw circle in real time using equation y = sqrt(r^2 - x^2)
void st7789_draw_circle_eq(ST7789_par* par, int cx, int cy, int r, uint16_t color){
	for (int x = 0; x <= r; x++) {
		int y = (int)(sqrt(r*r - x*x) + 0.5f); // round to nearest integer

		// plot all 8 symmetric points
		st7789_draw_pixel(par, cx + x, cy + y, color);
		st7789_draw_pixel(par, cx - x, cy + y, color);
		st7789_draw_pixel(par, cx + x, cy - y, color);
		st7789_draw_pixel(par, cx - x, cy - y, color);

		st7789_draw_pixel(par, cx + y, cy + x, color);
		st7789_draw_pixel(par, cx - y, cy + x, color);
		st7789_draw_pixel(par, cx + y, cy - x, color);
		st7789_draw_pixel(par, cx - y, cy - x, color);
	}
}

void st7789_fill_circle_v1( ST7789_par* par, int x0, int y0, int r, uint16_t color ){
	if(r <= 0) return;

	int x = r;
	int y = 0;
	int err = 1 - x;

	while(x >= y) {
		st7789_draw_line(par, x0 - x, y0 + y, x0 + x, y0 + y, color);
		st7789_draw_line(par, x0 - y, y0 + x, x0 + y, y0 + x, color);
		st7789_draw_line(par, x0 - x, y0 - y, x0 + x, y0 - y, color);
		st7789_draw_line(par, x0 - y, y0 - x, x0 + y, y0 - x, color);

		y++;

		if(err < 0) {
			err += 2*y + 1;
			} else {
			x--;
			err += 2*(y - x) + 1;
		}
	}
}

void st7789_fill_circle_v2( ST7789_par* par, int x0, int y0, int r, uint16_t color ){
	int x = r;
	int y = 0;
	int err = 1 - x;

	while(x >= y) {
		st7789_draw_line(par, x0 + x, y0 - y, x0 + x, y0 + y, color);
		st7789_draw_line(par, x0 - x, y0 - y, x0 - x, y0 + y, color);
		st7789_draw_line(par, x0 + y, y0 - x, x0 + y, y0 + x, color);
		st7789_draw_line(par, x0 - y, y0 - x, x0 - y, y0 + x, color);

		y++;

		if(err < 0) {
			err += 2*y + 1;
			} else {
			x--;
			err += 2*(y - x) + 1;
		}
	}
}

