BitNibble/STM32F411CEU6/workspace/F411CEU6-4/lib/src/st7789.c
void draw_random_circles(ST7789* lcd, uint8_t num){
	for(int i = 0; i < num; i++) {
		// Random position
		int x = rand() % lcd->par.width;
		int y = rand() % lcd->par.height;

		// Random size 1, 2, or 3 pixels
		int size = 1 + (rand() % 8);

		// Random color based on size
		uint16_t color;
		if(size < 3) color = ST77XX_WHITE;
		else if(size < 6) color = ST77XX_YELLOW;
		else color = ST77XX_ORANGE;

		// Draw the star (use your circle function for size >1, pixel for size==1)
		if(size == 1) lcd->draw_pixel(&lcd->par, x, y, color);
		else lcd->fill_circle_v1(&lcd->par, x, y, size, color);
	}
}

void st7789_draw_star5( ST7789_par* par, int cx, int cy, int r_outer, int r_inner, uint16_t color ){
	int x[10];
	int y[10];

	// Start pointing up
	float angle = -M_PI / 2.0f;
	float step  = M_PI / 5.0f; // 36�

	for(int i = 0; i < 10; i++) {
		int r = (i & 1) ? r_inner : r_outer;
		x[i] = cx + (int)(r * cosf(angle));
		y[i] = cy + (int)(r * sinf(angle));
		angle += step;
	}

	// Connect points
	for(int i = 0; i < 10; i++) {
		int j = (i + 1) % 10;
		st7789_draw_line(par, x[i], y[i], x[j], y[j], color);
	}
}

uint8_t step_bits(uint16_t pixel_pos){
	uint8_t val = 0;
	switch(pixel_pos & 7){
		case 7: val = 0; break;
		case 6: val = 1; break;
		case 5: val = 2; break;
		case 4: val = 3; break;
		case 3: val = 4; break;
		case 2: val = 5; break;
		case 1: val = 6; break;
		case 0: val = 7; break;
	}; return val;
}

void st7789_draw_raw_bitmap_fg(ST7789_par* par, const uint8_t* bitmap, uint16_t x0, uint16_t y0, uint16_t w, uint16_t h, uint16_t fg_color){
	uint16_t total_pixel = w * h;

	uint16_t current_byte_index = 0xFFFF; // invalid initially
	uint8_t byte = 0;

	for (uint16_t pixel = 0; pixel < total_pixel; pixel++) {
		uint16_t x = pixel % w;
		uint16_t y = pixel / w;

		uint16_t byte_index = pixel >> 3;

		// Only read progmem when entering a new byte
		if (byte_index != current_byte_index) {
			current_byte_index = byte_index;
			byte = pgm_read_byte(bitmap + byte_index);
		}

		uint8_t bit = 7 - (pixel & 7);

		if (byte & (1 << bit)) {
			int16_t sx = x0 + x;
			int16_t sy = y0 + y;

			// ignore out-of-bound
			if ((uint16_t)sx >= par->width || (uint16_t)sy >= par->height) continue;

			st7789_draw_pixel(par, sx, sy, fg_color);
		}
	}
}

void st7789_draw_adjust_bitmap_fg(ST7789_par* par, const uint8_t* bitmap, uint16_t x0, uint16_t y0, uint16_t w, uint16_t h, uint16_t fg_color){
	uint16_t width = _pad_width8(w);
	uint16_t total_pixel = width * h;

	uint16_t current_byte_index = 0xFFFF; // invalid initially
	uint8_t byte = 0;

	for (uint16_t pixel = 0; pixel < total_pixel; pixel++) {
		uint16_t x = pixel % width;
		uint16_t y = pixel / width;

		uint16_t byte_index = pixel >> 3;

		// Only read progmem when entering a new byte
		if (byte_index != current_byte_index){ // oneshot
			current_byte_index = byte_index;
			byte = pgm_read_byte(bitmap + byte_index);
		}

		uint8_t bit = 7 - (pixel & 7);

		if (byte & (1 << bit)) {
			int16_t sx = x0 + x;
			int16_t sy = y0 + y;

			// ignore out-of-bound
			if ((uint16_t)sx >= par->width || (uint16_t)sy >= par->height) continue;

			st7789_draw_pixel(par, sx, sy, fg_color);
		}
	}
}

void st7789_dump_buffer( ST7789_par* par, const uint16_t* buf, uint16_t bw, uint16_t bh, uint16_t x0, uint16_t y0, uint16_t transparent ){
	if(!buf) return;

	for(uint16_t y = 0; y < bh; y++){
		uint16_t sy = y0 + y;
		if(sy >= par->height) continue;

		for(uint16_t x = 0; x < bw; x++){
			uint16_t sx = x0 + x;
			if(sx >= par->width) continue;

			uint16_t color = buf[y * bw + x];

			if(color == transparent) continue;

			st7789_draw_pixel(par, sx, sy, color);
		}
	}
}

void st7789_dump_image( ST7789_par* par, uint16_t x0, uint16_t y0, const uint16_t *img, uint16_t w, uint16_t h, uint16_t transparent ){
	for (uint16_t y = 0; y < h; y++) {
		for (uint16_t x = 0; x < w; x++) {

			uint16_t color = pgm_read_word(img + (y * w + x));

			if (color == transparent)
			continue;   // ?? leave background untouched

			st7789_draw_pixel(par, x0 + x, y0 + y, color);
		}
	}
}

// Test pin blink for debugging
void st7789_test_pin(ST7789_par* par, uint8_t pin) {
	if(pin >= 8) return;
	for(uint8_t repeat = 0; repeat < 10; repeat++) {
		set_pin(par->scl_gpio, pin);
		_delay_ms(200);
		clear_pin(par->scl_gpio, pin);
		_delay_ms(200);
	}
}

/*** Default Setup ***/
/*** GPIO Setup ***/
void st7789_setup_gpio(ST7789_par* par)
{
    // Enable GPIO clocks
    if(par->scl_gpio) GPIO_clock(par->scl_gpio, 1);  // SCL port also holds CS/DC/RST
    if(par->sda_gpio) GPIO_clock(par->sda_gpio, 1);  // SDA port

    // CS, DC, RST -> Output
    if(par->scl_gpio) {
        GPIO_moder(par->scl_gpio, par->cs_pin, MODE_OUTPUT);
        GPIO_moder(par->scl_gpio, par->dc_pin, MODE_OUTPUT);
        GPIO_moder(par->scl_gpio, par->rst_pin, MODE_OUTPUT);

        GPIO_otype(par->scl_gpio, par->cs_pin, 0);
        GPIO_otype(par->scl_gpio, par->dc_pin, 0);
        GPIO_otype(par->scl_gpio, par->rst_pin, 0);

        GPIO_pupd(par->scl_gpio, par->cs_pin, 0);
        GPIO_pupd(par->scl_gpio, par->dc_pin, 0);
        GPIO_pupd(par->scl_gpio, par->rst_pin, 0);
    }

    // SPI pins -> Alternate Function
    if(par->sda_gpio) {
        GPIO_moder(par->sda_gpio, par->sda_pin, MODE_AF);
        GPIO_otype(par->sda_gpio, par->sda_pin, 0);
        GPIO_ospeed(par->sda_gpio, par->sda_pin, 3);
        GPIO_pupd(par->sda_gpio, par->sda_pin, 0);
        GPIO_af(par->sda_gpio, par->sda_pin, 5); // AF5 = SPI
    }

    if(par->scl_gpio) {
        GPIO_moder(par->scl_gpio, par->scl_pin, MODE_AF);
        GPIO_otype(par->scl_gpio, par->scl_pin, 0);
        GPIO_ospeed(par->scl_gpio, par->scl_pin, 3);
        GPIO_pupd(par->scl_gpio, par->scl_pin, 0);
        GPIO_af(par->scl_gpio, par->scl_pin, 5); // AF5 = SPI
    }

    // Initial pin states
    if(par->scl_gpio) {
        GPIO_set_hpins(par->scl_gpio, (1 << par->cs_pin) | (1 << par->rst_pin)); // CS & RST high
        GPIO_clear_hpins(par->scl_gpio, (1 << par->dc_pin));                     // DC low
    }
}

/*** SPI Setup ***/
void st7789_setup_spi(ST7789_par* par)
{
    if(!par->spi) return;

    STM32F411CEU6_Instance* device = dev();
    SPI_TypeDef* spi = par->spi;

    // Enable SPI clock
    if(spi == SPI1) device->rcc->APB2ENR |= RCC_APB2ENR_SPI1EN_Msk;
    else if(spi == SPI2) device->rcc->APB1ENR |= RCC_APB1ENR_SPI2EN_Msk;
    else if(spi == SPI3) device->rcc->APB1ENR |= RCC_APB1ENR_SPI3EN_Msk;

