BitNibble/STM32F411CEU6/workspace/F411CEU6-4/lib/src/st7789.c
    // Disable SPI before configuring
    spi->CR1 &= ~SPI_CR1_SPE_Msk;

    // Master mode, software slave management, internal slave select
    spi->CR1 = SPI_CR1_MSTR_Msk | SPI_CR1_SSM_Msk | SPI_CR1_SSI_Msk;

    // Clock polarity & phase = 0, baudrate = fPCLK/2
    spi->CR1 &= ~(SPI_CR1_CPOL_Msk | SPI_CR1_CPHA_Msk | SPI_CR1_BR_Msk);

    // Full duplex, 8-bit, MSB first
    spi->CR1 &= ~(SPI_CR1_BIDIMODE_Msk | SPI_CR1_DFF_Msk | SPI_CR1_LSBFIRST_Msk);

    // Enable SPI
    spi->CR1 |= SPI_CR1_SPE_Msk;
}

/*** Initial Screen ***/
void boot_screen(ST7789_par* par){
	U_word color = { .var = 0x0340 };
	st7789_start(par);
	st7789_set_window(par, 0, 0, 239, 239);
	for (uint32_t i = 0; i < 240UL * 240; i++) {
		st7789_data(par, color.par.h);
		st7789_data(par, color.par.l);
	}
	st7789_stop(par);
}

/***** Enable ST7789 handler *****/
ST7789 st7789_enable(SPI_TypeDef* spi, uint8_t cs_pin, uint8_t dc_pin, uint8_t rst_pin, uint16_t *fb) {
    ST7789 st;

    // -------------------------
    // Fill fixed parameters
    // -------------------------
    st.par.spi     = spi;
    st.par.cs_pin  = cs_pin;
    st.par.dc_pin  = dc_pin;
    st.par.rst_pin = rst_pin;
    st.par.width   = 240;
    st.par.height  = 240;
    st.par.fb      = fb;

    // -------------------------
    // Auto-detect GPIOs/pins
    // -------------------------
    if (spi == SPI1) {
        st.par.sda_gpio = GPIOB;  // MOSI
        st.par.scl_gpio = GPIOB;  // SCK + CS/DC/RST
        st.par.sda_pin  = 5;      // PB5 = SPI1_MOSI
        st.par.scl_pin  = 3;      // PB3 = SPI1_SCK
    } else if (spi == SPI2) {
        st.par.sda_gpio = GPIOB;
        st.par.scl_gpio = GPIOB;
        st.par.sda_pin  = 15;     // PB15 = SPI2_MOSI
        st.par.scl_pin  = 13;     // PB13 = SPI2_SCK
    } else if (spi == SPI3) {
        st.par.sda_gpio = GPIOC;
        st.par.scl_gpio = GPIOC;
        st.par.sda_pin  = 12;     // PC12 = SPI3_MOSI
        st.par.scl_pin  = 10;     // PC10 = SPI3_SCK
    } else {
        st.par.sda_gpio = NULL;
        st.par.scl_gpio = NULL;
        st.par.sda_pin  = 0;
        st.par.scl_pin  = 0;
    }

    // -------------------------
    // Assign setup functions
    // -------------------------
    st.setup.gpio = st7789_setup_gpio;
    st.setup.spi  = st7789_setup_spi;

    // -------------------------
    // Setup GPIO & SPI
    // -------------------------
    if (st.setup.gpio) st.setup.gpio(&st.par);
    if (st.setup.spi)  st.setup.spi(&st.par);

    // -------------------------
    // Systick
    // -------------------------
    systick_inic();

    // -------------------------
    // Reset & Init
    // -------------------------
    st.reset = st7789_reset;
    st.reset(&st.par);

    st7789_init_seq(&st.par);

    boot_screen(&st.par);

    // -------------------------
    // Assign V-table functions
    // -------------------------
    st.start           = st7789_start;
    st.stop            = st7789_stop;
    st.spi_tx          = st7789_spi_tx;
    st.cmd             = st7789_cmd;
    st.data            = st7789_data;
    st.draw_pixel      = st7789_draw_pixel;
    st.fill_screen     = st7789_fill_screen;
    st.drawfont8x12    = st7789_drawfont8x12;
    st.drawstring8x12  = st7789_drawstring8x12;
    st.drawfont16x16   = st7789_drawfont16x16;
    st.drawstring12x16 = st7789_drawstring12x16;
    st.drawfont24x24   = st7789_drawfont24x24;
    st.drawstring16x24 = st7789_drawstring16x24;
    st.draw_line       = st7789_draw_line;
    st.draw_line_eq    = st7789_draw_line_eq;
    st.draw_circle     = st7789_draw_circle;
    st.draw_circle_eq  = st7789_draw_circle_eq;
    st.fill_circle_v1  = st7789_fill_circle_v1;
    st.fill_circle_v2  = st7789_fill_circle_v2;
    st.draw_random_circles = draw_random_circles;
    st.draw_star5      = st7789_draw_star5;
    st.draw_raw_bitmap_fg    = st7789_draw_raw_bitmap_fg;
    st.draw_adjust_bitmap_fg = st7789_draw_adjust_bitmap_fg;
    st.dump_buffer     = st7789_dump_buffer;
    st.dump_image      = st7789_dump_image;
    st.test_pin        = st7789_test_pin;

    return st;
}

/*** EOF ***/

